app/controllers/friends_controller.rb

  def update
    respond_to do |format|
      if @friend.update(friend_params)
---
UPDATE "friends" SET "phone" = ?, "twitter" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["phone", "12345678901"], ["twitter", "@jcruz"], ["updated_at", "2021-08-28 22:04:42.971548"], ["id", 6]]